{
  "last_updated": "2025-10-01T18:06:59.658642",
  "total_publications": 20,
  "author_info": {
    "name": "Jixiang Qing",
    "affiliation": "Lancaster University",
    "total_citations": 231,
    "h_index": 8,
    "i10_index": 5,
    "scholar_id": "mE9l0sQAAAAJ"
  },
  "tldr_generation_stats": {
    "full_paper": 5,
    "generated": 2,
    "abstract": 13
  },
  "publications": [
    {
      "id": "the_catechol_benchmark__time_series_solvent_select_2025",
      "title": "The Catechol Benchmark: Time-series Solvent Selection Data for Few-shot Machine Learning",
      "authors": "T Boyne, JS Campos, BD Langdon, J Qing, Y Xie, S Zhang, C Tsay, ...",
      "year": 2025,
      "venue": "arXiv preprint arXiv:2506.07619, 2025",
      "abstract": "Machine learning has promised to change the landscape of laboratory chemistry, with impressive results in molecular property prediction and reaction retro-synthesis. However, chemical datasets are often inaccessible to the machine learning community as they tend to require cleaning, thorough understanding of the chemistry, or are simply not available. In this paper, we introduce a novel dataset for yield prediction, providing the first-ever transient flow dataset for machine learning benchmarking, covering over 1200 process conditions. While previous datasets focus on discrete parameters, our experimental set-up allow us to sample a large number of continuous process conditions, generating new challenges for machine learning models. We focus on solvent selection, a task that is particularly difficult to model theoretically and therefore ripe for machine learning applications. We showcase benchmarking for regression algorithms, transfer-learning approaches, feature engineering, and active learning, with important applications towards solvent replacement and sustainable manufacturing.",
      "claude_tldr": "arXiv:2506. 07619v1 cs.",
      "tldr_source": "full_paper",
      "url": "https://arxiv.org/pdf/2506.07619",
      "citations": 0,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "global_optimization_of_graph_acquisition_functions_2025",
      "title": "Global optimization of graph acquisition functions for neural architecture search",
      "authors": "Y Xie, S Zhang, J Qing, R Misener, C Tsay",
      "year": 2025,
      "venue": "arXiv preprint arXiv:2505.23640, 2025",
      "abstract": "Graph Bayesian optimization (BO) has shown potential as a powerful and data-efficient tool for neural architecture search (NAS). Most existing graph BO works focus on developing graph surrogates models, i.e., metrics of networks and/or different kernels to quantify the similarity between networks. However, the acquisition optimization, as a discrete optimization task over graph structures, is not well studied due to the complexity of formulating the graph search space and acquisition functions. This paper presents explicit optimization formulations for graph input space including properties such as reachability and shortest paths, which are used later to formulate graph kernels and the acquisition function. We theoretically prove that the proposed encoding is an equivalent representation of the graph space and provide restrictions for the NAS domain with either node or edge labels. Numerical results over several NAS benchmarks show that our method efficiently finds the optimal architecture for most cases, highlighting its efficacy.",
      "claude_tldr": "arXiv:2505. 23640v1 cs.",
      "tldr_source": "full_paper",
      "url": "https://arxiv.org/pdf/2505.23640",
      "citations": 1,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "system_aware_neural_ode_processes_for_few_shot_bay_2025",
      "title": "System-Aware Neural ODE Processes for Few-Shot Bayesian Optimization",
      "authors": "Jixiang Qing, Becky D Langdon, Robert M Lee, Behrang Shafei, Mark van der ...",
      "year": 2025,
      "venue": "Transactions on Machine Learning Research, 2025",
      "abstract": "We consider the problem of optimizing initial conditions and termination time in dynamical systems governed by unknown ordinary differential equations (ODEs), where evaluating different initial conditions is costly and the state's value can not be measured in real-time but only with a delay while the measuring device processes the sample. To identify the optimal conditions in limited trials, we introduce a few-shot Bayesian Optimization (BO) framework based on the system's prior information. At the core of our approach is the System-Aware Neural ODE Processes (SANODEP), an extension of Neural ODE Processes (NODEP) designed to meta-learn ODE systems from multiple trajectories using a novel context embedding block. We further develop a two-stage BO framework to effectively incorporate search space constraints, enabling efficient optimization of both initial conditions and observation timings. We conduct extensive experiments showcasing SANODEP's potential for few-shot BO within dynamical systems. We also explore SANODEP's adaptability to varying levels of prior information, highlighting the trade-off between prior flexibility and model fitting accuracy.",
      "claude_tldr": "Research contribution related to system-aware neural ode processes for few-shot bayesian optimization.",
      "tldr_source": "generated",
      "url": "",
      "citations": 1,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "bogrape__bayesian_optimization_over_graphs_with_sh_2025",
      "title": "BoGrape: Bayesian optimization over graphs with shortest-path encoded",
      "authors": "Y Xie, S Zhang, J Qing, R Misener, C Tsay",
      "year": 2025,
      "venue": "arXiv preprint arXiv:2503.05642, 2025",
      "abstract": "Graph-structured data play an important role across science and industry. This paper asks: how can we optimize over graphs, for instance to find the best graph structure and/or node features that minimize an expensive-to-evaluate black-box objective? Such problem settings arise, e.g., in molecular design, neural architecture search, and sensor placement. Bayesian optimization is a powerful tool for optimizing black-box functions, and existing technologies can be applied to optimize functions over nodes of a single fixed graph. We present Bayesian optimization acquisition functions for a class of shortest-path kernels and formulate them as mixed-integer optimization problems, enabling global exploration of the graph domain while maintaining solution feasibility when problem-specific constraints are present. We demonstrate our proposed approach, BoGrape, on several molecular design case studies.",
      "claude_tldr": "BOGRAPE : BAYESIAN OPTIMIZATION OVER GRAPHS WITH SHORTEST -PATH ENCODED Yilin Xie, Shiqiang Zhang, Jixiang Qing, Ruth Misener, Calvin Tsay Department of Computing, Imperial College London London, United Kingdom ABSTRACT Graph-structured data play an important role across science and industry.",
      "tldr_source": "full_paper",
      "url": "https://arxiv.org/pdf/2503.05642",
      "citations": 4,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "molecular_design_using_graph_bayesian_optimization_2025",
      "title": "Molecular design using graph Bayesian optimization with shortest-path kernels",
      "authors": "Y Xie, S Zhang, J Qing, R Misener, C Tsay",
      "year": 2025,
      "venue": "ICLR 2025 Workshop on Generative and Experimental Perspectives for …, 2025",
      "abstract": "Past decades have seen the great potential of generative machine learning in molecular design while also exposed the gap between research contributions and practical applications. Considering the expensive-to-evaluate nature of molecular properties and hard-to-satisfy validity of molecular structures, this paper tackles molecular design from graph Bayesian optimization viewpoint, i.e., generating feasible and optimal molecular graph with compatible features given limited number of evaluations. Our proposed method, BoGrape, uses shortest-path graph kernels to measure the similarity between molecules and utilizes mixed-integer programming to allow global exploration of molecular space while maintaining the feasibility of generated candidates. Preliminary results show promising performance of BoGrape.",
      "claude_tldr": "Past decades have seen the great potential of generative machine learning in molecular design while also exposed the gap between research contributions and practical applications.",
      "tldr_source": "abstract",
      "url": "",
      "citations": 1,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "knee_detection_in_bayesian_multi_objective_optimiz_2024",
      "title": "Knee detection in bayesian multi-objective optimization using thompson sampling",
      "authors": "A Heidari, J Qing, SR Gonzalez, J Branke, T Dhaene, I Couckuyt",
      "year": 2024,
      "venue": "IEEE Transactions on Evolutionary Computation, 2024",
      "abstract": "Real-world problems often consist of multiple conflicting objectives to be optimized simultaneously, featuring a set of Pareto-optimal solutions. Estimating the entire Pareto front can be computationally expensive, and is not always necessary, as decision makers will likely be interested only in specific regions of the Pareto front. In the absence of knowledge about the decision maker preferences, the so-called knees in the Pareto front are considered to be particularly attractive. In this paper, we propose using Thompson Sampling in the Bayesian optimization framework to estimate the location of the knee regions in a data-efficient manner. Our experimental results show that the proposed methods accurately locate the knee regions after a very small number of evaluations, providing a computationally efficient approach to single-and multi-knee detection in multi-objective optimization.",
      "claude_tldr": "Real-world problems often consist of multiple conflicting objectives to be optimized simultaneously, featuring a set of Pareto-optimal solutions.",
      "tldr_source": "abstract",
      "url": "https://ieeexplore.ieee.org/abstract/document/10667668/",
      "citations": 2,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "wind_turbine_hybrid_physics_based_deep_learning_mo_2024",
      "title": "Wind turbine hybrid physics-based deep learning model for a health monitoring approach considering provision of ancillary services",
      "authors": "N Kayedpour, J Qing, J Wauters, JDM De Kooning, I Couckuyt, ...",
      "year": 2024,
      "venue": "IEEE Transactions on Instrumentation and Measurement 73, 1-14, 2024",
      "abstract": "Assessing the overall condition of wind turbines (WTs) in operation is challenging due to their intricate nature. This becomes even more complicated when WTs provide ancillary services and respond to grid requirements under curtailment modes. Multiple models are required to effectively evaluate the WTs’ healthy condition, which can be unmanageable and impractical, particularly for large-scale wind farms. This article proposes a novel hybrid physics-based deep learning framework to accurately approximate the time-varying correlation between control sequences and system response, reflecting the aerodynamic nonlinearity of the 5-MW offshore WT model, designed and tested by the National Renewable Energy Laboratory (NREL). Another layer of this study’s novelty relies on proposing a computationally efficient weakly supervised method that uses the hybrid structure to detect degradations and anomalies …",
      "claude_tldr": "Assessing the overall condition of wind turbines (WTs) in operation is challenging due to their intricate nature.",
      "tldr_source": "abstract",
      "url": "https://ieeexplore.ieee.org/abstract/document/10464363/",
      "citations": 4,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "a_robust_multi_objective_bayesian_optimization_fra_2023",
      "title": "A robust multi-objective Bayesian optimization framework considering input uncertainty",
      "authors": "J Qing, I Couckuyt, T Dhaene",
      "year": 2023,
      "venue": "Journal of Global Optimization 86 (3), 693-711, 2023",
      "abstract": "Bayesian optimization is a popular tool for optimizing time-consuming objective functions with a limited number of function evaluations. In real-life applications like engineering design, the designer often wants to take multiple objectives as well as input uncertainty into account to find a set of robust solutions. While this is an active topic in single-objective Bayesian optimization, it is less investigated in the multi-objective case. We introduce a novel Bayesian optimization framework to perform multi-objective optimization considering input uncertainty. We propose a robust Gaussian Process model to infer the Bayes risk criterion to quantify robustness, and we develop a two-stage Bayesian optimization process to search for a robust Pareto frontier, i.e., solutions that have good average performance under input uncertainty. The complete framework supports various distributions of the input uncertainty and takes full …",
      "claude_tldr": "Noname manuscript No. (will be inserted by the editor) A Robust Multi-Objective Bayesian Optimization Framework Considering Input Uncertainty Jixiang Qing Ivo Couckuyt Tom Dhaene Received: date  Accepted: date ABSTRACT Bayesian optimization is a popular tool for data-ecient optimization of ex- pensive objective functions.",
      "tldr_source": "full_paper",
      "url": "https://arxiv.org/pdf/2202.12848",
      "citations": 14,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "_pf_es__parallel_feasible_pareto_frontier_entropy__2023",
      "title": "{PF}ES: Parallel Feasible Pareto Frontier Entropy Search for Multi-Objective Bayesian Optimization",
      "authors": "J Qing, HB Moss, T Dhaene, I Couckuyt",
      "year": 2023,
      "venue": "International Conference on Artificial Intelligence and Statistics, 2565-2588, 2023",
      "abstract": "We present Parallel Feasible Pareto Frontier Entropy Search ( ES)—a novel information-theoretic acquisition function for multi-objective Bayesian optimization supporting unknown constraints and batch queries. Due to the complexity of characterizing the mutual information between candidate evaluations and (feasible) Pareto frontiers, existing approaches must either employ crude approximations that significantly hamper their performance or rely on expensive inference schemes that substantially increase the optimization’s computational overhead. By instead using a variational lower bound, ES provides a low-cost and accurate estimate of the mutual information. We benchmark ES against other information-theoretic acquisition functions, demonstrating its competitive performance for optimization across synthetic and real-world design problems.",
      "claude_tldr": "We present Parallel Feasible Pareto Frontier Entropy Search ( ES)—a novel information-theoretic acquisition function for multi-objective Bayesian optimization supporting unknown constraints and batch queries.",
      "tldr_source": "abstract",
      "url": "https://proceedings.mlr.press/v206/qing23a.html",
      "citations": 8,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "trieste__efficiently_exploring_the_depths_of_black_2023",
      "title": "Trieste: Efficiently exploring the depths of black-box functions with tensorflow",
      "authors": "V Picheny, J Berkeley, HB Moss, H Stojic, U Granta, SW Ober, A Artemev, ...",
      "year": 2023,
      "venue": "arXiv preprint arXiv:2302.08436, 2023",
      "abstract": "We present Trieste, an open-source Python package for Bayesian optimization and active learning benefiting from the scalability and efficiency of TensorFlow. Our library enables the plug-and-play of popular TensorFlow-based models within sequential decision-making loops, e.g. Gaussian processes from GPflow or GPflux, or neural networks from Keras. This modular mindset is central to the package and extends to our acquisition functions and the internal dynamics of the decision-making loop, both of which can be tailored and extended by researchers or engineers when tackling custom use cases. Trieste is a research-friendly and production-ready toolkit backed by a comprehensive test suite, extensive documentation, and available at https://github.com/secondmind-labs/trieste.",
      "claude_tldr": "Trieste: Eciently Exploring The Depths of Black-box Functions with TensorFlow Victor Picheny victorsecondmind.",
      "tldr_source": "full_paper",
      "url": "https://arxiv.org/pdf/2302.08436",
      "citations": 40,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "bayesian_active_learning_for_engineering_design_an_2023",
      "title": "Bayesian active learning for engineering design and optimization under uncertainty",
      "authors": "J Qing",
      "year": 2023,
      "venue": "Ghent University, 2023",
      "abstract": "Het ontwerpen in de praktijk is een complex probleem dat het iteratief afstemmen van productparameters omvat om een bevredigende prestatie te vinden. De evaluatie van de prestaties ervan omvat meestal tijds- of kostbare simulaties die vragen om algoritmen die minder evaluaties nodig hebben. De snelle evolutie van machine learning heeft snel kansen geboden voor dergelijke problemen, waar modelgebaseerde adaptieve afstemmingsalgoritmen kunnen worden uitgevonden. Deze dissertatie draagt bij aan deze inspanning door Bayesian-modellen en op hen gebaseerde Active Learning-technieken te verkennen om nieuwe sequentiële optimale ontwerpen te bedenken voor verschillende problemen en doelen. Het uiteindelijke doel is om automatisch afstemmen te bereiken om betere ontwerpconfiguraties te verkrijgen die meer rekenkundig efficiënt zijn.",
      "claude_tldr": "Het ontwerpen in de praktijk is een complex probleem dat het iteratief afstemmen van productparameters omvat om een bevredigende prestatie te vinden.",
      "tldr_source": "abstract",
      "url": "",
      "citations": 0,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "finding_knees_in_bayesian_multi_objective_optimiza_2022",
      "title": "Finding knees in bayesian multi-objective optimization",
      "authors": "A Heidari, J Qing, S Rojas Gonzalez, J Branke, T Dhaene, I Couckuyt",
      "year": 2022,
      "venue": "International Conference on Parallel Problem Solving from Nature, 104-117, 2022",
      "abstract": "Multi-objective optimization requires many evaluations to identify a sufficiently dense approximation of the Pareto front. Especially for a higher number of objectives, extracting the Pareto front might not be easy nor cheap. On the other hand, the Decision-Maker is not always interested in the entire Pareto front, and might prefer a solution where there is a desirable trade-off between different objectives. An example of an attractive solution is the knee point of the Pareto front, although the current literature differs on the definition of a knee. In this work, we propose to detect knee solutions in a data-efficient manner (i.e., with a limited number of time-consuming evaluations), according to two definitions of knees. In particular, we propose several novel acquisition functions in the Bayesian Optimization framework for detecting these knees, which allows for scaling to many objectives. The suggested acquisition functions are …",
      "claude_tldr": "Multi-objective optimization requires many evaluations to identify a sufficiently dense approximation of the Pareto front.",
      "tldr_source": "abstract",
      "url": "https://link.springer.com/chapter/10.1007/978-3-031-14714-2_8",
      "citations": 9,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "adaptive_sampling_with_automatic_stopping_for_feas_2022",
      "title": "Adaptive sampling with automatic stopping for feasible region identification in engineering design",
      "authors": "J Qing, N Knudde, F Garbuglia, D Spina, I Couckuyt, T Dhaene",
      "year": 2022,
      "venue": "Engineering with Computers 38 (Suppl 3), 1955-1972, 2022",
      "abstract": "Engineering design is a complex process to find a suitable trade-off among different, and sometimes conflicting, design specifications. In reality, these requirements can be often considered as constraints of the design problem, that can be defined in terms of performance measures or geometrical characteristics of the device under study. In this paper, a new design space exploration methodology is presented for discovering feasible regions in the design space, where the term feasible region indicates the set of all design configurations satisfying all constraints of the design problem. The proposed method is based on Gaussian process metamodels to estimate the feasible region and leverages a information-based adaptive sampling technique to sequentially refine the prediction accuracy, which is applicable for multiple constraints problems. To efficiently stop the adaptive sampling process, a novel framework to …",
      "claude_tldr": "Engineering design is a complex process to find a suitable trade-off among different, and sometimes conflicting, design specifications.",
      "tldr_source": "abstract",
      "url": "https://link.springer.com/article/10.1007/s00366-021-01341-7",
      "citations": 4,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "a_robust_bayesian_optimization_framework_for_micro_2022",
      "title": "A robust bayesian optimization framework for microwave circuit design under uncertainty",
      "authors": "D De Witte, J Qing, I Couckuyt, T Dhaene, D Vande Ginste, D Spina",
      "year": 2022,
      "venue": "Electronics 11 (14), 2267, 2022",
      "abstract": "In modern electronics, there are many inevitable uncertainties and variations of design parameters that have a profound effect on the performance of a device. These are, among others, induced by manufacturing tolerances, assembling inaccuracies, material diversities, machining errors, etc. This prompts wide interests in enhanced optimization algorithms that take the effect of these uncertainty sources into account and that are able to find robust designs, i.e., designs that are insensitive to the uncertainties early in the design cycle. In this work, a novel machine learning-based optimization framework that accounts for uncertainty of the design parameters is presented. This is achieved by using a modified version of the expected improvement criterion. Moreover, a data-efficient Bayesian Optimization framework is leveraged to limit the number of simulations required to find a robust design solution. Two suitable application examples validate that the robustness is significantly improved compared to standard design methods.",
      "claude_tldr": "In modern electronics, there are many inevitable uncertainties and variations of design parameters that have a profound effect on the performance of a device.",
      "tldr_source": "abstract",
      "url": "",
      "citations": 10,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "spectral_representation_of_robustness_measures_for_2022",
      "title": "Spectral representation of robustness measures for optimization under input uncertainty",
      "authors": "J Qing, T Dhaene, I Couckuyt",
      "year": 2022,
      "venue": "38th International Conference on Machine Learning (ICML), 2022",
      "abstract": "We study the inference of mean-variance robustness measures to quantify input uncertainty under the Gaussian Process (GP) framework. These measures are widely used in applications where the robustness of the solution is of interest, for example, in engineering design. While the variance is commonly used to characterize the robustness, Bayesian inference of the variance using GPs is known to be challenging. In this paper, we propose a Spectral Representation of Robustness Measures based on the GP’s spectral representation, ie, an analytical approach to approximately infer both robustness measures for normal and uniform input uncertainty distributions. We present two approximations based on different Fourier features and compare their accuracy numerically. To demonstrate their utility and efficacy in robust Bayesian Optimization, we integrate the analytical robustness measures in three standard acquisition functions for various robust optimization formulations. We show their competitive performance on numerical benchmarks and real-life applications.",
      "claude_tldr": "We study the inference of mean-variance robustness measures to quantify input uncertainty under the Gaussian Process (GP) framework.",
      "tldr_source": "abstract",
      "url": "",
      "citations": 9,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "hovering_efficiency_optimization_of_the_ducted_pro_2021",
      "title": "Hovering efficiency optimization of the ducted propeller with weight penalty taken into account",
      "authors": "Y Hu, J xiang Qing, ZH Liu, ZJ Conrad, JN Cao, XP Zhang",
      "year": 2021,
      "venue": "Aerospace science and technology 117, 106937, 2021",
      "abstract": "The ducted propeller is superior to the open propeller in hovering efficiency. However, the overall system efficiency of a ducted propeller is reduced due to its heavy structure. If the weight penalty is taken into account, will the ducted propeller still be superior to an open propeller? And in this scenario, how will a ducted propeller with better efficiency than an open propeller be designed? This paper investigates these questions by parametric analysis based on experiments and then parametric optimization that involves hovering efficiency and structural weight in objective functions. Both multi-disciplinary design optimization and multi-objective programming are performed by surrogate-based optimization. An in-house automatic structured mesh generation module is developed to deal with significant geometry variation in design space. Finally, the optimization results are validated by post-optimization experiments. The …",
      "claude_tldr": "The ducted propeller is superior to the open propeller in hovering efficiency.",
      "tldr_source": "abstract",
      "url": "https://www.sciencedirect.com/science/article/pii/S1270963821004478",
      "citations": 89,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "batch_bayesian_active_learning_for_feasible_region_2020",
      "title": "Batch Bayesian active learning for feasible region identification by local penalization",
      "authors": "J Qing, N Knudde, I Couckuyt, T Dhaene, K Shintani",
      "year": 2020,
      "venue": "2020 Winter Simulation Conference (WSC), 2779-2790, 2020",
      "abstract": "Identifying all designs satisfying a set of constraints is an important part of the engineering design process. With physics-based simulation codes, evaluating the constraints becomes considerable expensive. Active learning can provide an elegant approach to efficiently characterize the feasible region, i.e., the set of feasible designs. Although active learning strategies have been proposed for this task, most of them are dealing with adding just one sample per iteration as opposed to selecting multiple samples per iteration, also known as batch active learning. While this is efficient with respect to the amount of information gained per iteration, it neglects available computation resources. We propose a batch Bayesian active learning technique for feasible region identification by assuming that the constraint function is Lipschitz continuous. In addition, we extend current state-of-the-art batch methods to also handle …",
      "claude_tldr": "Identifying all designs satisfying a set of constraints is an important part of the engineering design process.",
      "tldr_source": "abstract",
      "url": "https://ieeexplore.ieee.org/abstract/document/9383951/",
      "citations": 4,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "bayesian_active_learning_for_electromagnetic_struc_2020",
      "title": "Bayesian active learning for electromagnetic structure design",
      "authors": "J Qing, N Knudde, I Couckuyt, D Spina, T Dhaene",
      "year": 2020,
      "venue": "2020 14th European Conference on Antennas and Propagation (EuCAP), 1-5, 2020",
      "abstract": "A novel design framework based on Bayesian active learning is presented in this contribution. The proposed approach allows one to identify a set of design configurations satisfying the chosen specification. In particular, the entropy search-based active learning strategy, which relies on a Gaussian Process model, is able to minimize the number of time-consuming computer simulations or expensive design trials necessary to reach this goal. A suitable application example validates the proposed method.",
      "claude_tldr": "A novel design framework based on Bayesian active learning is presented in this contribution.",
      "tldr_source": "abstract",
      "url": "https://ieeexplore.ieee.org/abstract/document/9136051/",
      "citations": 7,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "kriging_assisted_integrated_rotor_duct_optimizatio_2019",
      "title": "Kriging Assisted Integrated Rotor-Duct Optimization for Ducted Fan in Hover",
      "authors": "J Qing, Y Hu, Y Wang, Z Liu, X Fu, W Liu",
      "year": 2019,
      "venue": "AIAA Scitech 2019 Forum, 0007, 2019",
      "abstract": "D fan, first proposed by Stipa at 1932, has been used for thrust augmentation for more than half a century and still shows growing interest on many applications, like MAV, flying cars, helicopters and Fan-in-wing configurations. Apart from the high efficiency, its other appealing advantages are noise reduction and improved safety. While brings with extra lift, the flow in the duct becomes very complex that many geometry parameters like duct shape, propeller tip clearance and propeller shape tend to affect the performance of the system. In order to analyze the flow mechanism of ducted fan, Grunwald and Goodson [1] investigated how the distribution of aerodynamic loads on the fan and duct contributed to the overall aerodynamics of the configuration. They confirmed that the duct is the main source of normal force and pitching moment and roughly half of the thrust is provided by the duct in hover. Black, Wainauski and …",
      "claude_tldr": "D fan, first proposed by Stipa at 1932, has been used for thrust augmentation for more than half a century and still shows growing interest on many applications, like MAV, flying cars, helicopters and Fan-in-wing configurations.",
      "tldr_source": "abstract",
      "url": "https://arc.aiaa.org/doi/pdf/10.2514/6.2019-0007",
      "citations": 24,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    },
    {
      "id": "a_meta_learning_approach_for_few_shot_bayesian_opt",
      "title": "A Meta-Learning Approach for Few-Shot Bayesian Optimization of Batch Chemical Processes",
      "authors": "B Langdon, G Patron, J Qing, C Kappatou, RM Lee, B Shafei, R Misener, ...",
      "year": null,
      "venue": "2025 AIChE Annual Meeting, 0",
      "abstract": "",
      "claude_tldr": "Research contribution related to a meta-learning approach for few-shot bayesian optimization of batch chemical processes.",
      "tldr_source": "generated",
      "url": "",
      "citations": 0,
      "filled_manually": false,
      "media": null,
      "custom_description": null,
      "links": [],
      "tags": [],
      "featured": false
    }
  ],
  "categorized": {
    "by_year": {
      "2025": [
        {
          "id": "the_catechol_benchmark__time_series_solvent_select_2025",
          "title": "The Catechol Benchmark: Time-series Solvent Selection Data for Few-shot Machine Learning",
          "authors": "T Boyne, JS Campos, BD Langdon, J Qing, Y Xie, S Zhang, C Tsay, ...",
          "year": 2025,
          "venue": "arXiv preprint arXiv:2506.07619, 2025",
          "abstract": "Machine learning has promised to change the landscape of laboratory chemistry, with impressive results in molecular property prediction and reaction retro-synthesis. However, chemical datasets are often inaccessible to the machine learning community as they tend to require cleaning, thorough understanding of the chemistry, or are simply not available. In this paper, we introduce a novel dataset for yield prediction, providing the first-ever transient flow dataset for machine learning benchmarking, covering over 1200 process conditions. While previous datasets focus on discrete parameters, our experimental set-up allow us to sample a large number of continuous process conditions, generating new challenges for machine learning models. We focus on solvent selection, a task that is particularly difficult to model theoretically and therefore ripe for machine learning applications. We showcase benchmarking for regression algorithms, transfer-learning approaches, feature engineering, and active learning, with important applications towards solvent replacement and sustainable manufacturing.",
          "claude_tldr": "arXiv:2506. 07619v1 cs.",
          "tldr_source": "full_paper",
          "url": "https://arxiv.org/pdf/2506.07619",
          "citations": 0,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "global_optimization_of_graph_acquisition_functions_2025",
          "title": "Global optimization of graph acquisition functions for neural architecture search",
          "authors": "Y Xie, S Zhang, J Qing, R Misener, C Tsay",
          "year": 2025,
          "venue": "arXiv preprint arXiv:2505.23640, 2025",
          "abstract": "Graph Bayesian optimization (BO) has shown potential as a powerful and data-efficient tool for neural architecture search (NAS). Most existing graph BO works focus on developing graph surrogates models, i.e., metrics of networks and/or different kernels to quantify the similarity between networks. However, the acquisition optimization, as a discrete optimization task over graph structures, is not well studied due to the complexity of formulating the graph search space and acquisition functions. This paper presents explicit optimization formulations for graph input space including properties such as reachability and shortest paths, which are used later to formulate graph kernels and the acquisition function. We theoretically prove that the proposed encoding is an equivalent representation of the graph space and provide restrictions for the NAS domain with either node or edge labels. Numerical results over several NAS benchmarks show that our method efficiently finds the optimal architecture for most cases, highlighting its efficacy.",
          "claude_tldr": "arXiv:2505. 23640v1 cs.",
          "tldr_source": "full_paper",
          "url": "https://arxiv.org/pdf/2505.23640",
          "citations": 1,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "system_aware_neural_ode_processes_for_few_shot_bay_2025",
          "title": "System-Aware Neural ODE Processes for Few-Shot Bayesian Optimization",
          "authors": "Jixiang Qing, Becky D Langdon, Robert M Lee, Behrang Shafei, Mark van der ...",
          "year": 2025,
          "venue": "Transactions on Machine Learning Research, 2025",
          "abstract": "We consider the problem of optimizing initial conditions and termination time in dynamical systems governed by unknown ordinary differential equations (ODEs), where evaluating different initial conditions is costly and the state's value can not be measured in real-time but only with a delay while the measuring device processes the sample. To identify the optimal conditions in limited trials, we introduce a few-shot Bayesian Optimization (BO) framework based on the system's prior information. At the core of our approach is the System-Aware Neural ODE Processes (SANODEP), an extension of Neural ODE Processes (NODEP) designed to meta-learn ODE systems from multiple trajectories using a novel context embedding block. We further develop a two-stage BO framework to effectively incorporate search space constraints, enabling efficient optimization of both initial conditions and observation timings. We conduct extensive experiments showcasing SANODEP's potential for few-shot BO within dynamical systems. We also explore SANODEP's adaptability to varying levels of prior information, highlighting the trade-off between prior flexibility and model fitting accuracy.",
          "claude_tldr": "Research contribution related to system-aware neural ode processes for few-shot bayesian optimization.",
          "tldr_source": "generated",
          "url": "",
          "citations": 1,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "bogrape__bayesian_optimization_over_graphs_with_sh_2025",
          "title": "BoGrape: Bayesian optimization over graphs with shortest-path encoded",
          "authors": "Y Xie, S Zhang, J Qing, R Misener, C Tsay",
          "year": 2025,
          "venue": "arXiv preprint arXiv:2503.05642, 2025",
          "abstract": "Graph-structured data play an important role across science and industry. This paper asks: how can we optimize over graphs, for instance to find the best graph structure and/or node features that minimize an expensive-to-evaluate black-box objective? Such problem settings arise, e.g., in molecular design, neural architecture search, and sensor placement. Bayesian optimization is a powerful tool for optimizing black-box functions, and existing technologies can be applied to optimize functions over nodes of a single fixed graph. We present Bayesian optimization acquisition functions for a class of shortest-path kernels and formulate them as mixed-integer optimization problems, enabling global exploration of the graph domain while maintaining solution feasibility when problem-specific constraints are present. We demonstrate our proposed approach, BoGrape, on several molecular design case studies.",
          "claude_tldr": "BOGRAPE : BAYESIAN OPTIMIZATION OVER GRAPHS WITH SHORTEST -PATH ENCODED Yilin Xie, Shiqiang Zhang, Jixiang Qing, Ruth Misener, Calvin Tsay Department of Computing, Imperial College London London, United Kingdom ABSTRACT Graph-structured data play an important role across science and industry.",
          "tldr_source": "full_paper",
          "url": "https://arxiv.org/pdf/2503.05642",
          "citations": 4,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "molecular_design_using_graph_bayesian_optimization_2025",
          "title": "Molecular design using graph Bayesian optimization with shortest-path kernels",
          "authors": "Y Xie, S Zhang, J Qing, R Misener, C Tsay",
          "year": 2025,
          "venue": "ICLR 2025 Workshop on Generative and Experimental Perspectives for …, 2025",
          "abstract": "Past decades have seen the great potential of generative machine learning in molecular design while also exposed the gap between research contributions and practical applications. Considering the expensive-to-evaluate nature of molecular properties and hard-to-satisfy validity of molecular structures, this paper tackles molecular design from graph Bayesian optimization viewpoint, i.e., generating feasible and optimal molecular graph with compatible features given limited number of evaluations. Our proposed method, BoGrape, uses shortest-path graph kernels to measure the similarity between molecules and utilizes mixed-integer programming to allow global exploration of molecular space while maintaining the feasibility of generated candidates. Preliminary results show promising performance of BoGrape.",
          "claude_tldr": "Past decades have seen the great potential of generative machine learning in molecular design while also exposed the gap between research contributions and practical applications.",
          "tldr_source": "abstract",
          "url": "",
          "citations": 1,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        }
      ],
      "2024": [
        {
          "id": "knee_detection_in_bayesian_multi_objective_optimiz_2024",
          "title": "Knee detection in bayesian multi-objective optimization using thompson sampling",
          "authors": "A Heidari, J Qing, SR Gonzalez, J Branke, T Dhaene, I Couckuyt",
          "year": 2024,
          "venue": "IEEE Transactions on Evolutionary Computation, 2024",
          "abstract": "Real-world problems often consist of multiple conflicting objectives to be optimized simultaneously, featuring a set of Pareto-optimal solutions. Estimating the entire Pareto front can be computationally expensive, and is not always necessary, as decision makers will likely be interested only in specific regions of the Pareto front. In the absence of knowledge about the decision maker preferences, the so-called knees in the Pareto front are considered to be particularly attractive. In this paper, we propose using Thompson Sampling in the Bayesian optimization framework to estimate the location of the knee regions in a data-efficient manner. Our experimental results show that the proposed methods accurately locate the knee regions after a very small number of evaluations, providing a computationally efficient approach to single-and multi-knee detection in multi-objective optimization.",
          "claude_tldr": "Real-world problems often consist of multiple conflicting objectives to be optimized simultaneously, featuring a set of Pareto-optimal solutions.",
          "tldr_source": "abstract",
          "url": "https://ieeexplore.ieee.org/abstract/document/10667668/",
          "citations": 2,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "wind_turbine_hybrid_physics_based_deep_learning_mo_2024",
          "title": "Wind turbine hybrid physics-based deep learning model for a health monitoring approach considering provision of ancillary services",
          "authors": "N Kayedpour, J Qing, J Wauters, JDM De Kooning, I Couckuyt, ...",
          "year": 2024,
          "venue": "IEEE Transactions on Instrumentation and Measurement 73, 1-14, 2024",
          "abstract": "Assessing the overall condition of wind turbines (WTs) in operation is challenging due to their intricate nature. This becomes even more complicated when WTs provide ancillary services and respond to grid requirements under curtailment modes. Multiple models are required to effectively evaluate the WTs’ healthy condition, which can be unmanageable and impractical, particularly for large-scale wind farms. This article proposes a novel hybrid physics-based deep learning framework to accurately approximate the time-varying correlation between control sequences and system response, reflecting the aerodynamic nonlinearity of the 5-MW offshore WT model, designed and tested by the National Renewable Energy Laboratory (NREL). Another layer of this study’s novelty relies on proposing a computationally efficient weakly supervised method that uses the hybrid structure to detect degradations and anomalies …",
          "claude_tldr": "Assessing the overall condition of wind turbines (WTs) in operation is challenging due to their intricate nature.",
          "tldr_source": "abstract",
          "url": "https://ieeexplore.ieee.org/abstract/document/10464363/",
          "citations": 4,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        }
      ],
      "2023": [
        {
          "id": "a_robust_multi_objective_bayesian_optimization_fra_2023",
          "title": "A robust multi-objective Bayesian optimization framework considering input uncertainty",
          "authors": "J Qing, I Couckuyt, T Dhaene",
          "year": 2023,
          "venue": "Journal of Global Optimization 86 (3), 693-711, 2023",
          "abstract": "Bayesian optimization is a popular tool for optimizing time-consuming objective functions with a limited number of function evaluations. In real-life applications like engineering design, the designer often wants to take multiple objectives as well as input uncertainty into account to find a set of robust solutions. While this is an active topic in single-objective Bayesian optimization, it is less investigated in the multi-objective case. We introduce a novel Bayesian optimization framework to perform multi-objective optimization considering input uncertainty. We propose a robust Gaussian Process model to infer the Bayes risk criterion to quantify robustness, and we develop a two-stage Bayesian optimization process to search for a robust Pareto frontier, i.e., solutions that have good average performance under input uncertainty. The complete framework supports various distributions of the input uncertainty and takes full …",
          "claude_tldr": "Noname manuscript No. (will be inserted by the editor) A Robust Multi-Objective Bayesian Optimization Framework Considering Input Uncertainty Jixiang Qing Ivo Couckuyt Tom Dhaene Received: date  Accepted: date ABSTRACT Bayesian optimization is a popular tool for data-ecient optimization of ex- pensive objective functions.",
          "tldr_source": "full_paper",
          "url": "https://arxiv.org/pdf/2202.12848",
          "citations": 14,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "_pf_es__parallel_feasible_pareto_frontier_entropy__2023",
          "title": "{PF}ES: Parallel Feasible Pareto Frontier Entropy Search for Multi-Objective Bayesian Optimization",
          "authors": "J Qing, HB Moss, T Dhaene, I Couckuyt",
          "year": 2023,
          "venue": "International Conference on Artificial Intelligence and Statistics, 2565-2588, 2023",
          "abstract": "We present Parallel Feasible Pareto Frontier Entropy Search ( ES)—a novel information-theoretic acquisition function for multi-objective Bayesian optimization supporting unknown constraints and batch queries. Due to the complexity of characterizing the mutual information between candidate evaluations and (feasible) Pareto frontiers, existing approaches must either employ crude approximations that significantly hamper their performance or rely on expensive inference schemes that substantially increase the optimization’s computational overhead. By instead using a variational lower bound, ES provides a low-cost and accurate estimate of the mutual information. We benchmark ES against other information-theoretic acquisition functions, demonstrating its competitive performance for optimization across synthetic and real-world design problems.",
          "claude_tldr": "We present Parallel Feasible Pareto Frontier Entropy Search ( ES)—a novel information-theoretic acquisition function for multi-objective Bayesian optimization supporting unknown constraints and batch queries.",
          "tldr_source": "abstract",
          "url": "https://proceedings.mlr.press/v206/qing23a.html",
          "citations": 8,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "trieste__efficiently_exploring_the_depths_of_black_2023",
          "title": "Trieste: Efficiently exploring the depths of black-box functions with tensorflow",
          "authors": "V Picheny, J Berkeley, HB Moss, H Stojic, U Granta, SW Ober, A Artemev, ...",
          "year": 2023,
          "venue": "arXiv preprint arXiv:2302.08436, 2023",
          "abstract": "We present Trieste, an open-source Python package for Bayesian optimization and active learning benefiting from the scalability and efficiency of TensorFlow. Our library enables the plug-and-play of popular TensorFlow-based models within sequential decision-making loops, e.g. Gaussian processes from GPflow or GPflux, or neural networks from Keras. This modular mindset is central to the package and extends to our acquisition functions and the internal dynamics of the decision-making loop, both of which can be tailored and extended by researchers or engineers when tackling custom use cases. Trieste is a research-friendly and production-ready toolkit backed by a comprehensive test suite, extensive documentation, and available at https://github.com/secondmind-labs/trieste.",
          "claude_tldr": "Trieste: Eciently Exploring The Depths of Black-box Functions with TensorFlow Victor Picheny victorsecondmind.",
          "tldr_source": "full_paper",
          "url": "https://arxiv.org/pdf/2302.08436",
          "citations": 40,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "bayesian_active_learning_for_engineering_design_an_2023",
          "title": "Bayesian active learning for engineering design and optimization under uncertainty",
          "authors": "J Qing",
          "year": 2023,
          "venue": "Ghent University, 2023",
          "abstract": "Het ontwerpen in de praktijk is een complex probleem dat het iteratief afstemmen van productparameters omvat om een bevredigende prestatie te vinden. De evaluatie van de prestaties ervan omvat meestal tijds- of kostbare simulaties die vragen om algoritmen die minder evaluaties nodig hebben. De snelle evolutie van machine learning heeft snel kansen geboden voor dergelijke problemen, waar modelgebaseerde adaptieve afstemmingsalgoritmen kunnen worden uitgevonden. Deze dissertatie draagt bij aan deze inspanning door Bayesian-modellen en op hen gebaseerde Active Learning-technieken te verkennen om nieuwe sequentiële optimale ontwerpen te bedenken voor verschillende problemen en doelen. Het uiteindelijke doel is om automatisch afstemmen te bereiken om betere ontwerpconfiguraties te verkrijgen die meer rekenkundig efficiënt zijn.",
          "claude_tldr": "Het ontwerpen in de praktijk is een complex probleem dat het iteratief afstemmen van productparameters omvat om een bevredigende prestatie te vinden.",
          "tldr_source": "abstract",
          "url": "",
          "citations": 0,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        }
      ],
      "2022": [
        {
          "id": "finding_knees_in_bayesian_multi_objective_optimiza_2022",
          "title": "Finding knees in bayesian multi-objective optimization",
          "authors": "A Heidari, J Qing, S Rojas Gonzalez, J Branke, T Dhaene, I Couckuyt",
          "year": 2022,
          "venue": "International Conference on Parallel Problem Solving from Nature, 104-117, 2022",
          "abstract": "Multi-objective optimization requires many evaluations to identify a sufficiently dense approximation of the Pareto front. Especially for a higher number of objectives, extracting the Pareto front might not be easy nor cheap. On the other hand, the Decision-Maker is not always interested in the entire Pareto front, and might prefer a solution where there is a desirable trade-off between different objectives. An example of an attractive solution is the knee point of the Pareto front, although the current literature differs on the definition of a knee. In this work, we propose to detect knee solutions in a data-efficient manner (i.e., with a limited number of time-consuming evaluations), according to two definitions of knees. In particular, we propose several novel acquisition functions in the Bayesian Optimization framework for detecting these knees, which allows for scaling to many objectives. The suggested acquisition functions are …",
          "claude_tldr": "Multi-objective optimization requires many evaluations to identify a sufficiently dense approximation of the Pareto front.",
          "tldr_source": "abstract",
          "url": "https://link.springer.com/chapter/10.1007/978-3-031-14714-2_8",
          "citations": 9,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "adaptive_sampling_with_automatic_stopping_for_feas_2022",
          "title": "Adaptive sampling with automatic stopping for feasible region identification in engineering design",
          "authors": "J Qing, N Knudde, F Garbuglia, D Spina, I Couckuyt, T Dhaene",
          "year": 2022,
          "venue": "Engineering with Computers 38 (Suppl 3), 1955-1972, 2022",
          "abstract": "Engineering design is a complex process to find a suitable trade-off among different, and sometimes conflicting, design specifications. In reality, these requirements can be often considered as constraints of the design problem, that can be defined in terms of performance measures or geometrical characteristics of the device under study. In this paper, a new design space exploration methodology is presented for discovering feasible regions in the design space, where the term feasible region indicates the set of all design configurations satisfying all constraints of the design problem. The proposed method is based on Gaussian process metamodels to estimate the feasible region and leverages a information-based adaptive sampling technique to sequentially refine the prediction accuracy, which is applicable for multiple constraints problems. To efficiently stop the adaptive sampling process, a novel framework to …",
          "claude_tldr": "Engineering design is a complex process to find a suitable trade-off among different, and sometimes conflicting, design specifications.",
          "tldr_source": "abstract",
          "url": "https://link.springer.com/article/10.1007/s00366-021-01341-7",
          "citations": 4,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "a_robust_bayesian_optimization_framework_for_micro_2022",
          "title": "A robust bayesian optimization framework for microwave circuit design under uncertainty",
          "authors": "D De Witte, J Qing, I Couckuyt, T Dhaene, D Vande Ginste, D Spina",
          "year": 2022,
          "venue": "Electronics 11 (14), 2267, 2022",
          "abstract": "In modern electronics, there are many inevitable uncertainties and variations of design parameters that have a profound effect on the performance of a device. These are, among others, induced by manufacturing tolerances, assembling inaccuracies, material diversities, machining errors, etc. This prompts wide interests in enhanced optimization algorithms that take the effect of these uncertainty sources into account and that are able to find robust designs, i.e., designs that are insensitive to the uncertainties early in the design cycle. In this work, a novel machine learning-based optimization framework that accounts for uncertainty of the design parameters is presented. This is achieved by using a modified version of the expected improvement criterion. Moreover, a data-efficient Bayesian Optimization framework is leveraged to limit the number of simulations required to find a robust design solution. Two suitable application examples validate that the robustness is significantly improved compared to standard design methods.",
          "claude_tldr": "In modern electronics, there are many inevitable uncertainties and variations of design parameters that have a profound effect on the performance of a device.",
          "tldr_source": "abstract",
          "url": "",
          "citations": 10,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "spectral_representation_of_robustness_measures_for_2022",
          "title": "Spectral representation of robustness measures for optimization under input uncertainty",
          "authors": "J Qing, T Dhaene, I Couckuyt",
          "year": 2022,
          "venue": "38th International Conference on Machine Learning (ICML), 2022",
          "abstract": "We study the inference of mean-variance robustness measures to quantify input uncertainty under the Gaussian Process (GP) framework. These measures are widely used in applications where the robustness of the solution is of interest, for example, in engineering design. While the variance is commonly used to characterize the robustness, Bayesian inference of the variance using GPs is known to be challenging. In this paper, we propose a Spectral Representation of Robustness Measures based on the GP’s spectral representation, ie, an analytical approach to approximately infer both robustness measures for normal and uniform input uncertainty distributions. We present two approximations based on different Fourier features and compare their accuracy numerically. To demonstrate their utility and efficacy in robust Bayesian Optimization, we integrate the analytical robustness measures in three standard acquisition functions for various robust optimization formulations. We show their competitive performance on numerical benchmarks and real-life applications.",
          "claude_tldr": "We study the inference of mean-variance robustness measures to quantify input uncertainty under the Gaussian Process (GP) framework.",
          "tldr_source": "abstract",
          "url": "",
          "citations": 9,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        }
      ],
      "2021": [
        {
          "id": "hovering_efficiency_optimization_of_the_ducted_pro_2021",
          "title": "Hovering efficiency optimization of the ducted propeller with weight penalty taken into account",
          "authors": "Y Hu, J xiang Qing, ZH Liu, ZJ Conrad, JN Cao, XP Zhang",
          "year": 2021,
          "venue": "Aerospace science and technology 117, 106937, 2021",
          "abstract": "The ducted propeller is superior to the open propeller in hovering efficiency. However, the overall system efficiency of a ducted propeller is reduced due to its heavy structure. If the weight penalty is taken into account, will the ducted propeller still be superior to an open propeller? And in this scenario, how will a ducted propeller with better efficiency than an open propeller be designed? This paper investigates these questions by parametric analysis based on experiments and then parametric optimization that involves hovering efficiency and structural weight in objective functions. Both multi-disciplinary design optimization and multi-objective programming are performed by surrogate-based optimization. An in-house automatic structured mesh generation module is developed to deal with significant geometry variation in design space. Finally, the optimization results are validated by post-optimization experiments. The …",
          "claude_tldr": "The ducted propeller is superior to the open propeller in hovering efficiency.",
          "tldr_source": "abstract",
          "url": "https://www.sciencedirect.com/science/article/pii/S1270963821004478",
          "citations": 89,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        }
      ],
      "2020": [
        {
          "id": "batch_bayesian_active_learning_for_feasible_region_2020",
          "title": "Batch Bayesian active learning for feasible region identification by local penalization",
          "authors": "J Qing, N Knudde, I Couckuyt, T Dhaene, K Shintani",
          "year": 2020,
          "venue": "2020 Winter Simulation Conference (WSC), 2779-2790, 2020",
          "abstract": "Identifying all designs satisfying a set of constraints is an important part of the engineering design process. With physics-based simulation codes, evaluating the constraints becomes considerable expensive. Active learning can provide an elegant approach to efficiently characterize the feasible region, i.e., the set of feasible designs. Although active learning strategies have been proposed for this task, most of them are dealing with adding just one sample per iteration as opposed to selecting multiple samples per iteration, also known as batch active learning. While this is efficient with respect to the amount of information gained per iteration, it neglects available computation resources. We propose a batch Bayesian active learning technique for feasible region identification by assuming that the constraint function is Lipschitz continuous. In addition, we extend current state-of-the-art batch methods to also handle …",
          "claude_tldr": "Identifying all designs satisfying a set of constraints is an important part of the engineering design process.",
          "tldr_source": "abstract",
          "url": "https://ieeexplore.ieee.org/abstract/document/9383951/",
          "citations": 4,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        },
        {
          "id": "bayesian_active_learning_for_electromagnetic_struc_2020",
          "title": "Bayesian active learning for electromagnetic structure design",
          "authors": "J Qing, N Knudde, I Couckuyt, D Spina, T Dhaene",
          "year": 2020,
          "venue": "2020 14th European Conference on Antennas and Propagation (EuCAP), 1-5, 2020",
          "abstract": "A novel design framework based on Bayesian active learning is presented in this contribution. The proposed approach allows one to identify a set of design configurations satisfying the chosen specification. In particular, the entropy search-based active learning strategy, which relies on a Gaussian Process model, is able to minimize the number of time-consuming computer simulations or expensive design trials necessary to reach this goal. A suitable application example validates the proposed method.",
          "claude_tldr": "A novel design framework based on Bayesian active learning is presented in this contribution.",
          "tldr_source": "abstract",
          "url": "https://ieeexplore.ieee.org/abstract/document/9136051/",
          "citations": 7,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        }
      ],
      "2019": [
        {
          "id": "kriging_assisted_integrated_rotor_duct_optimizatio_2019",
          "title": "Kriging Assisted Integrated Rotor-Duct Optimization for Ducted Fan in Hover",
          "authors": "J Qing, Y Hu, Y Wang, Z Liu, X Fu, W Liu",
          "year": 2019,
          "venue": "AIAA Scitech 2019 Forum, 0007, 2019",
          "abstract": "D fan, first proposed by Stipa at 1932, has been used for thrust augmentation for more than half a century and still shows growing interest on many applications, like MAV, flying cars, helicopters and Fan-in-wing configurations. Apart from the high efficiency, its other appealing advantages are noise reduction and improved safety. While brings with extra lift, the flow in the duct becomes very complex that many geometry parameters like duct shape, propeller tip clearance and propeller shape tend to affect the performance of the system. In order to analyze the flow mechanism of ducted fan, Grunwald and Goodson [1] investigated how the distribution of aerodynamic loads on the fan and duct contributed to the overall aerodynamics of the configuration. They confirmed that the duct is the main source of normal force and pitching moment and roughly half of the thrust is provided by the duct in hover. Black, Wainauski and …",
          "claude_tldr": "D fan, first proposed by Stipa at 1932, has been used for thrust augmentation for more than half a century and still shows growing interest on many applications, like MAV, flying cars, helicopters and Fan-in-wing configurations.",
          "tldr_source": "abstract",
          "url": "https://arc.aiaa.org/doi/pdf/10.2514/6.2019-0007",
          "citations": 24,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        }
      ],
      "Unknown": [
        {
          "id": "a_meta_learning_approach_for_few_shot_bayesian_opt",
          "title": "A Meta-Learning Approach for Few-Shot Bayesian Optimization of Batch Chemical Processes",
          "authors": "B Langdon, G Patron, J Qing, C Kappatou, RM Lee, B Shafei, R Misener, ...",
          "year": null,
          "venue": "2025 AIChE Annual Meeting, 0",
          "abstract": "",
          "claude_tldr": "Research contribution related to a meta-learning approach for few-shot bayesian optimization of batch chemical processes.",
          "tldr_source": "generated",
          "url": "",
          "citations": 0,
          "filled_manually": false,
          "media": null,
          "custom_description": null,
          "links": [],
          "tags": [],
          "featured": false
        }
      ]
    }
  }
}